of222/tutorials/rheoFoam/Aneurysm/HerschelBulkley/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    

    in1
    {
  
        type            codedFixedValue;
    	value           uniform (0 0 0);
    	redirectType    HBprofile;
    	code
    	#{
       
          const dictionary& constDict = db().lookupObject<IOdictionary>("constitutiveProperties");
          dimensionedScalar n_(constDict.subDict("parameters").lookup("n"));
          scalar n(n_.value());

          scalar R(1.69*0.001); // Slightly oversized to avoid negative values in the profile (extruion is not very accurate)

          vector Uin(0, 0.424214493, 0);

          const vectorField& x = patch().Cf();

          scalarField r = mag(x);

          operator==( ((3.*n+1.)/(n+1.))*( 1. - pow(r/R, (n+1.)/n)  ) * Uin   );
   	#};

    }
    
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
        
    }

    "(out.*)"
    {
        type            zeroGradient;
       
    }
    
}

// ************************************************************************* //
